burning-server/app/controllers/flights_controller.rb

  def search
    puts params

    flights = Flight.where origin: params[:origin], destination: params[:destination]
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = ? AND "flights"."destination" = ?  [["origin", "PER"], ["destination", "SYD"]]